NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG22/EFR32MG22C224F512IM32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFSENSE_S</name>
      <version>0</version>
      <description>RFSENSE_S Registers</description>
      <baseAddress>0x4009C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EN</name>
          <description>Block enables</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>RFSENSE Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4WUEN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EM4WUEN</name>
              <description>EM4 WakeUp Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configures RFSENSE digital logic behavior</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x03800000</resetValue>
          <resetMask>0x0780000D</resetMask>
          <fields>
            <field>
              <name>PREAMBLELEN</name>
              <description>Number of Preamble bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCWORDLEN</name>
              <description>Synword Length</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENERGYDUR</name>
              <description>RFSENSE Energy Duration</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dur1ms</name>
                  <description>1ms duration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dur2ms</name>
                  <description>2ms duration</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dur4ms</name>
                  <description>4ms duration</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dur8ms</name>
                  <description>8ms duration</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dur16ms</name>
                  <description>16ms duration</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dur32ms</name>
                  <description>32ms duration</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dur64ms</name>
                  <description>64ms duration</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dur128ms</name>
                  <description>128ms duration</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEGACYMODE</name>
              <description>RFSENSE Legacy Mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCWORD</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNCWORD</name>
              <description>Sync Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>THDSEL</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>THDSEL</name>
              <description>Threshold Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RFSENSE</name>
              <description>RFSENSE Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ</name>
              <description>Sequencer Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RFSENSE</name>
              <description>RFSENSE Interrrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ</name>
              <description>Sequencer Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALCFG</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x01050010</resetValue>
          <resetMask>0x130F70FF</resetMask>
          <fields>
            <field>
              <name>CALPERIOD</name>
              <description>Calibration Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCMCAL</name>
              <description>Disable Common Mode Calibration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPTATCAL</name>
              <description>Disable PTAT Calibration</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCALPUP</name>
              <description>Enable Calibration at Power Up</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTATCALSTEPS</name>
              <description>PTAT Calibration Steps</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STEPS2</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEPS4</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEPS6</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEPS8</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMCALSTEPS</name>
              <description>CM Calibration Steps</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STEPS2</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEPS4</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEPS6</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEPS8</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALSTEPCLKS</name>
              <description>Clocks per calibration step settling</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTATCALMODE</name>
              <description>PTAT Calibration mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFEN</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000060</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>ENBG</name>
              <description>Enable Bandgap</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGSTART</name>
              <description>Bandgap Startup Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTATISO</name>
              <description>Isolate PTAT core</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTATSTART</name>
              <description>PTAT Startup signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPFLTN</name>
              <description>Disable supply filtering</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCEN</name>
              <description>DC Bias Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESETN</name>
              <description>Reset RFSENSE data flop</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODESEL</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>MODESEL</name>
              <description>Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OP</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_CAL</name>
                  <description>Common-mode calibration</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REF_CAL</name>
                  <description>Bandgap Reference calibration</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_OP2</name>
                  <description>Normal operation mode-2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM_A_CAL</name>
                  <description>Differntial A calibration</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM_B_CAL</name>
                  <description>Differential B calibration</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM_A_CAL2</name>
                  <description>Differential A mode-2 calibration</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM_B_CAL2</name>
                  <description>Differential B mode-2 calibration</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCONF</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CHP</name>
              <description>Invert Comparator IO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS</name>
              <description>Enable Hysteresis</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLSN</name>
              <description>Disable Comparator reset pulse</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIMPTAT</name>
          <description>IPTAT Calbiration trim values</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000420</resetValue>
          <resetMask>0x0000073F</resetMask>
          <fields>
            <field>
              <name>TRIMRES</name>
              <description>PTAT reference resistor trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMCURR</name>
              <description>PTAT current trim</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>m80pct</name>
                  <description>Reduce PTAT current by 80%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m60pct</name>
                  <description>Reduce PTAT current by 60%</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m40pct</name>
                  <description>Reduce PTAT current by 40%</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m20pct</name>
                  <description>Reduce PTAT current by 20%</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>default</name>
                  <description>Default PTAT current</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p20pct</name>
                  <description>Increase PTAT current by 20%</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p40pct</name>
                  <description>Increase PTAT current by 40%</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>p60pct</name>
                  <description>Increase PTAT current by 60%</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIMBG</name>
          <description>BandGap Calibration trim values</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000088</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>TRIMREF</name>
              <description>Reference Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMTC</name>
              <description>TempCo Trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIMDAC</name>
          <description>RFSENSE DAC trim values</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007F7F</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIMCM</name>
              <description>Trim Common Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPOSCAL</name>
              <description>Comparator Offset Calibration value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMDM</name>
              <description>Trim Differential Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVDM</name>
              <description>Invert Differential offset polarity</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPARE</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000F1</resetMask>
          <fields>
            <field>
              <name>SPARE</name>
              <description>Spare register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGSPARE</name>
              <description>Digital Spare registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCTRL</name>
          <description>Enable Software Control of the FSM signals</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>SWCTRL</name>
              <description>New BitField</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANACLKINV</name>
              <description>Invert Analog clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
