NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG22/EFR32MG22C224F512IM32.svd
        <register>
          <name>BBUSALLOC</name>
          <description>B Bus allocation</description>
          <addressOffset>0x324</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>BEVEN0</name>
              <description>B Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEVEN1</name>
              <description>B Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODD0</name>
              <description>B Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODD1</name>
              <description>B Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CDBUSALLOC</name>
          <description>CD Bus allocation</description>
          <addressOffset>0x328</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>CDEVEN0</name>
              <description>CD Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDEVEN1</name>
              <description>CD Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDODD0</name>
              <description>CD Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDODD1</name>
              <description>CD Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPSELL</name>
          <description>External Interrupt Port Select Low</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33333333</resetMask>
          <fields>
            <field>
              <name>EXTIPSEL0</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL1</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL2</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL3</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL4</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL5</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL6</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL7</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPSELH</name>
          <description>External interrupt Port Select High</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003333</resetMask>
          <fields>
            <field>
              <name>EXTIPSEL0</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL1</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL2</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL3</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
