NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG22/EFR32MG22C224F512IM32.svd
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>
          <fields>
            <field>
              <name>TXFRAMESENT</name>
              <description>Frame sent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSYNCSENT</name>
              <description>Sync word sent</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPRESENT</name>
              <description>Preamble sent</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRAMPDONE</name>
              <description>Mod ramper idle</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDTNOARR</name>
              <description>No signal Detected in LDT </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHDSADET</name>
              <description>PHASE DSA DETECT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYUNCODEDET</name>
              <description>CONCURRENT UNCODED PHY DET</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYCODEDET</name>
              <description>CONCURRENT CODED PHY DET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMDET</name>
              <description>Timing detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPREDET</name>
              <description>Preamble detected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRAMEDET0</name>
              <description>Frame with sync-word 0 detected</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRAMEDET1</name>
              <description>Frame with sync-word 1 detected</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMLOST</name>
              <description>Timing lost</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPRELOST</name>
              <description>Preamble lost</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRAMEDETOF</name>
              <description>Frame detection overflow</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMNF</name>
              <description>Timing not found</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCTIMOUT</name>
              <description>DEMOD-FRC req/ack timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETS</name>
              <description>Early Time Stamp detect</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFGANTPATTRD</name>
              <description>CFGANTPATTRD</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x218</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000039</resetMask>
          <fields>
            <field>
              <name>PRESTOP</name>
              <description>Preamble stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AFCTXLOCK</name>
              <description>Lock AFC TX compensation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AFCTXCLEAR</name>
              <description>Clear AFC TX compensation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AFCRXCLEAR</name>
              <description>Clear AFC RX compensation.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSMSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x21C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>DETSTATE</name>
              <description>Detection FSM state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGSEARCH</name>
                  <description>Timing search</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESEARCH</name>
                  <description>Preamble search</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMESEARCH</name>
                  <description>Frame search</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Payload Detection</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMEDETMODE0</name>
                  <description>Timing search with sliding window (FDM0)</description>
                  <value>50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSASTATE</name>
              <description>Demodulator DSA FSM state</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARRIVALCHK</name>
                  <description>Arrival Check</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATUSCHK</name>
                  <description>Status Check</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPPW</name>
                  <description>SAMP_PW</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITPWRUP</name>
                  <description>WAIT_PWRUP</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITDSALO</name>
                  <description>WAIT_DSALO</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITABORT</name>
                  <description>WAIT_ABORT</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>STOP</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LRBLESTATE</name>
              <description>Demodulator long-range BLE FSM state</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEANUP</name>
                  <description>CLEANUP</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRCOE</name>
                  <description>CORRCOE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITLRDSA</name>
                  <description>WAIT_LR_DSA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXCORR</name>
                  <description>MAXCORR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITRDY</name>
                  <description>WAIT_RDY</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC1DATA</name>
                  <description>FEC1_DATA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC1ACK</name>
                  <description>FEC1_ACK</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>PAUSE</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC2DATA</name>
                  <description>FEC2_DATA</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC2ACK</name>
                  <description>FEC2_ACK</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKCUR</name>
                  <description>TRACK_CUR</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKEAR</name>
                  <description>TRACK_EAR</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKLAT</name>
                  <description>TRACK_LAT</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKDONE</name>
                  <description>TRACK_DONE</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDECISION</name>
                  <description>T_DECISION</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>STOP</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBBLESTATE</name>
              <description>Demodulator Narrow-band BLE FSM state</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTINITI</name>
                  <description>VTINITI</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDRNXT</name>
                  <description>ADDR_NXT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INICOST</name>
                  <description>INI_COST</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALCCOST</name>
                  <description>CALC_COST</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITALACQU</name>
                  <description>INITAL_ACQU</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITALCOSTCALC</name>
                  <description>INITAL_COST_CALC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINCOSTCALC</name>
                  <description>MIN_COST_CALC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQACQU</name>
                  <description>FREQ_ACQU</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQACQUDONE</name>
                  <description>FREQ_ACQU_DONE</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQUEARLY</name>
                  <description>TIMING_ACQU_EARLY</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQUCURR</name>
                  <description>TIMING_ACQU_CURR</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQULATE</name>
                  <description>TIMING_ACQU_LATE</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQUDONE</name>
                  <description>TIMING_ACQU_DONE</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIINIT0</name>
                  <description>VIRTBI_INIT0</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIINIT1</name>
                  <description>VIRTBI_INIT1</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIRXSYNC</name>
                  <description>VIRTBI_RXSYNC</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIRXPAYLOAD</name>
                  <description>VIRTBI_RXPAYLOAD</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDRXSYNC</name>
                  <description>HARD_RXSYNC</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDXPAYLOAD</name>
                  <description>HARD_RXPAYLOAD</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKFREQ</name>
                  <description>TRACK_FREQ</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKTIMEARLY</name>
                  <description>TRACK_TIM_EARLY</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKTIMCURR</name>
                  <description>TRACK_TIM_CURR</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKTIMLATE</name>
                  <description>TRACK_TIM_LATE</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKDONE</name>
                  <description>TRACK_DONE</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKDECISION</name>
                  <description>TRACK_DECISION</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>STOP</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITACK</name>
                  <description>WAIT_ACK</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG</description>
                  <value>28</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTDIVSTATE</name>
              <description>Antenna diversity control state</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST_ANT0</name>
                  <description>First ANT0 selection</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST_ANT1</name>
                  <description>First ANT1 selection</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMSEARCH_ANT0</name>
                  <description>Timing search on ANT0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMSEARCH_ANT1</name>
                  <description>Timing search on ANT1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDET_ANT0</name>
                  <description>Check ANT1 after timing detecton ANT0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDET_ANT1</name>
                  <description>Check ANT0 after timing detecton ANT1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVALUATE</name>
                  <description>Evaluate and select better antenna</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMSEARCH_SELECTED</name>
                  <description>Searching on better antenna</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDET_SELECTED</name>
                  <description>Selected better antenna</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEAT_ANT0</name>
                  <description>Repeat ANT0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEAT_ANT1</name>
                  <description>Repeat ANT1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>Manual mode</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
